In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','rohan','shlok','shubh'],
    "marks":[33,44,55,22],
    "city":['mumbai','pune','tripura','raigad']
}

In [3]:
df= pd.DataFrame(dict1)

In [4]:
df

    name  marks     city
0  harry     33   mumbai
1  rohan     44     pune
2  shlok     55  tripura
3  shubh     22   raigad